exampleCases/other/turbineTuning_DTU10MW_ALMAdv/1refinement_runs/10MW_1refinement_template/system/topoSetDict.local.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict.local.1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
actions
(
    {
        name         local;
        type         cellSet;
        action       new;
        source       rotatedBoxToCell;
        sourceInfo
        {
            origin (  250.0   250.0   0.0);
            i      (  500.0     0.0   0.0);
            j      (     0.0  500.0   0.0);
            k      (     0.0    0.0 250.0);
        }
    }
 
);
 
// ************************************************************************* //
